#+TITLE: A linear response, DFT+U study of trends in the oxygen evolution activity of transition metal rutile dioxides
#+LATEX_CLASS: achemso
#+LATEX_CLASS_OPTIONS: [journal=jpccck,manuscript=suppinfo,email=true]
#+latex_header: \setkeys{acs}{biblabel=brackets,super=true,articletitle=true}
#+latex_header: \SectionNumbersOn
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: author:nil date:nil ^:{}

#+latex_header: \usepackage[utf8]{inputenc}

#+latex_header: \usepackage{url}
#+latex_header: \usepackage[version=3]{mhchem}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{color}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{wasysym}
#+latex_header: \usepackage{latexsym}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{lmodern}
#+latex_header: \usepackage{minted}


#+latex_header: \usepackage[linktocpage, pdfstartview=FitH, colorlinks, linkcolor=black, anchorcolor=black, citecolor=black, filecolor=black, menucolor=black, urlcolor=black]{hyperref}
#+latex_header: \usepackage{attachfile}
#+latex_header: \author{Zhongnan Xu}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}
#+latex_header: \author{Jan Rossmeisl}
#+latex_header: \affiliation{Center for Atomic-Scale Materials Design, Department of Physics, Technical University of Denmark, Building 307, 2800 Kgs. Lyngby, Denmark}
#+latex_header: \author{John R. Kitchin}
#+latex_header: \email{jkitchin@andrew.cmu.edu}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}

#+LATEX_HEADER: \usemintedstyle{emacs}
#+LATEX_HEADER: \newminted{python}{fontsize=\footnotesize}

\maketitle

** Store Gibbs free reaction energies into tables \label{sec-OER-volcano-storage}
   :PROPERTIES:
   :CUSTOM_ID: sec-OER-volcano-storage
   :END:
The adsorption energies of OH, O, and OOH can be used to calculate the thermodynamic activity barriers for oxygen evolution. This is done below for both the adsorption energies at $U=0$ and $U=U_{calc}$. The code below reads the adsorption energies at all /U/ values and extracts out the reaction energy of each reaction step at the linear response /U/ value. The zero-point energy contributions, taken from a previous study, are included in the calculation of adsorption energies cite:man-2011-univer. This amounts to a value of 0.35 eV, 0.05 eV and 0.4 eV added to the adsorption energies of OH, O, and OOH, respectively.

#+BEGIN_SRC python
from espresso import *
from ase_addons.surfaces import rutile110
from ase.visualize import view
from ase.lattice.surface import add_adsorbate
import matplotlib.pyplot as plt
from matplotlib.colors import Normalize
from scipy.interpolate import interp1d
import numpy as np

data = [['IrO2', 4.54, 3.18, 0.31],
        ['RuO2', 4.53, 3.12, 0.31],
        ['PtO2', 4.59, 3.23, 0.31],
        ['RhO2', 4.55, 3.11, 0.31]]

linUs = [['IrO2', 5.91],
         ['RuO2', 6.73],
         ['PtO2', 6.25],
         ['RhO2', 5.97]]

U_dict = {}
for oxide, U in linUs:
    U_dict[oxide] = U    

def ads_energy(bare, OH, O, OOH):
    '''The reaction is shown below
    H2O + *  <=> HO* + H + e
    HO*      <=> O* + H + e
    O* + H2O <=> HOO* + H + e
    HOO*     <=> O2 + H + e
    '''

    H2 = -31.6933245045 # From H2 in a box
    H2O = -470.68191439 # From H2O in a box
    
    try:
        OH_ads = OH - bare - (H2O - 0.5 * H2) + 0.35
    except:
        OH_ads = None

    try:
        O_ads = O - bare - (H2O - H2) + 0.05
    except:
        O_ads = None

    try:
        OOH_ads = OOH - bare - (2*H2O - 3./2. * H2) + 0.4
    except:
        OOH_ads = None

    return OH_ads, O_ads, OOH_ads

Us = np.linspace(0.0, 8.0, 17)

table_header =  '|Name|$\\Delta G_{1}^{U0}$|$\\Delta G_{2}^{U0}$|$\\Delta G_{3}^{U0}$|$\\Delta G_{4}^{U0}$|'
table_header += '$\\Delta G_{1}^{Ucalc}$|$\\Delta G_{2}^{Ucalc}$|$\\Delta G_{3}^{Ucalc}$|$\\Delta G_{4}^{Ucalc}$|'

print '#+CAPTION: Reaction energies at both U=0 the calculated linear response U value'
print '#+ATTR_LATEX: :placement [H] :align |c|c|c|c|c|c|c|c|c|'
print '#+TBLNAME: rxn-energies'
print '|---|'

for name, a, c, u in data:
    O_energies, OH_energies, OOH_energies = [], [], []
    O_Us, OH_Us, OOH_Us = [], [], []
    for U in Us:
        # First get the slab energy
        calcdir = 'supporting-data/{name}/Eads-2-layers/bare-U-{U:1.1f}'.format(**locals())
        with Espresso(calcdir) as calc:
            if calc.converged == True:
                bare = calc.get_potential_energy()
            else:
                continue

        Eads = {}
        for ads in ('OH', 'O', 'OOH'):
            calcdir = 'supporting-data/{name}/Eads-2-layers/{ads}-U-{U:1.1f}'.format(**locals())
            with Espresso(calcdir) as calc:
                if calc.converged == True:
                    Eads[ads] = calc.get_potential_energy()
                else:
                    Eads[ads] = None

        energies = ads_energy(bare, Eads['OH'], Eads['O'], Eads['OOH'])
        for ads, E_ads in zip(('OH', 'O', 'OOH'), energies):
            if E_ads is not None:
                eval(ads + '_energies').append(E_ads)
                eval(ads + '_Us').append(U)

    # After the data is collected, read the adsorption energy data at U0 and Ucalc
    O_func = interp1d(O_Us, O_energies, kind='linear')
    OH_func = interp1d(OH_Us, OH_energies, kind='linear')
    OOH_func = interp1d(OOH_Us, OOH_energies, kind='linear')
    
    E_O_U0 = O_func(0)
    E_OH_U0 = OH_func(0)
    E_OOH_U0 = OOH_func(0)

    E_O_Ucalc = O_func(U_dict[name])
    E_OH_Ucalc = OH_func(U_dict[name])
    E_OOH_Ucalc = OOH_func(U_dict[name])

    # Now print out the reaction barriers
    r1_U0 = E_OH_U0
    r2_U0 = E_O_U0 - E_OH_U0
    r3_U0 = E_OOH_U0 - E_O_U0
    r4_U0 = 4.92 - E_OOH_U0

    r1_Ucalc = E_OH_Ucalc
    r2_Ucalc = E_O_Ucalc - E_OH_Ucalc
    r3_Ucalc = E_OOH_Ucalc - E_O_Ucalc
    r4_Ucalc = 4.92 - E_OOH_Ucalc

    s = '|{0}|{1:1.3f}|{2:1.3f}|{3:1.3f}|{4:1.3f}|{5:1.3f}|{6:1.3f}|{7:1.3f}|{8:1.3f}|'

    print s.format(name, float(r1_U0), float(r2_U0), float(r3_U0), float(r4_U0), 
                   float(r1_Ucalc), float(r2_Ucalc), float(r3_Ucalc), float(r4_Ucalc))
#+END_SRC

#+RESULTS:
#+CAPTION: Reaction energies at both $U=0$ the calculated linear response $U$ value
#+ATTR_LATEX: :placement [H] :align |c|c|c|c|c|c|c|c|c|
#+TBLNAME: rxn-energies
| Name | $\Delta G_{1}^{U0}$ | $\Delta G_{2}^{U0}$ | $\Delta G_{3}^{U0}$ | $\Delta G_{4}^{U0}$ | $\Delta G_{1}^{Ucalc}$ | $\Delta G_{2}^{Ucalc}$ | $\Delta G_{3}^{Ucalc}$ | $\Delta G_{4}^{Ucalc}$ |
|------+---------------------+---------------------+---------------------+---------------------+------------------------+------------------------+------------------------+------------------------|
| IrO2 |               0.089 |               1.392 |               1.983 |               1.456 |                  0.410 |                  1.539 |                  1.751 |                  1.219 |
| RuO2 |               0.569 |               1.102 |               2.336 |               0.912 |                  0.824 |                  1.207 |                  2.181 |                  0.708 |
| PtO2 |               0.964 |               2.197 |               1.196 |               0.563 |                  1.115 |                  2.393 |                  0.922 |                  0.490 |
| RhO2 |               0.989 |               1.821 |               1.489 |               0.621 |                  1.289 |                  2.015 |                  1.191 |                  0.425 |

